ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4429caf-ac6e-49ad-bef0-355badcab738">
    <name>КоличествоУпаковокПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e4bc4c5c-4c75-4666-8d21-f7f403a23514">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cef36287-09dd-4448-9e9e-5c90a8111d2c">
    <name>НаименованиеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e9606203-88e5-4b62-bc25-9f152c0eecfe">
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e76279a-4f34-44a9-b997-752bfa2a4a30">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d12a6578-0ee7-4c40-a0c0-f24b03afa6bc">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e72bf9d-e251-478c-bd3e-7fb8e78584c0">
    <name>ТребуетсяЗаполнитьПоОперациям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88bb5796-07b6-4854-bafc-05701368c7dc">
    <name>ФактическоеНачалоЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97258e31-badf-4c52-808f-88d24f4369d1">
    <name>ФактическоеОкончаниеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d65a15ce-a56d-4017-bbbc-210858c2c05f">
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="273df2c3-514f-4b41-af58-a60420b68979">
    <name>КоличествоУпаковокФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>П3_СлужебныйПересчетВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтатусДоКонтроля</name>
    <type>
      <types>EnumRef.СтатусыЭтаповПроизводства2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДатаДокументКотнроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ВремяКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТехПотери</name>
    <comment>//++ ШмелевР 04.03.2026 ПРЗ.3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_Брак</name>
    <comment>//++ ШмелевР 04.03.2026 ПРЗ.3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f0cdedc1-9f3a-4821-ab6c-f2792fa18854">
    <name>ВыходныеИзделияСерии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="028a2250-ffdf-406c-868f-fb624d295146">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="96e6c801-bf9a-48f0-9e19-1f68a05fe6eb">
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2849e137-bfbf-4c16-b65f-8183ef3dcfd6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e615f87c-b1fe-424a-ba73-2107af37992d">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc5c02ab-4758-47ca-a469-aeac95072209">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>П3_НазначениеДоПересчета</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/НомераСерийПоВидам/НомераСерийПоВидам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераСерийПоВидам</name>
  <comment>//cbr-larkovgeorg 27.02.2026 ПРЗ.33(перенос функционала)</comment>
  <resources>
    <name>НомерСерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ШаблоныНаименованийСерий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="48a11946-4d50-41a7-919b-49bf18403be5">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/cbr_ПредопределенныеЗначенияКонстант/cbr_ПредопределенныеЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ПредопределенныеЗначенияКонстант</name>
  <comment>//cbr-larkovgeorg 15.02.2026 СКЛ.12(по указанию архитектора)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ТранспортныеУслугиДоставкаПокупателюТранспортнойКомпании26</name>
      <description>26 Транспортные услуги доставка покупателю транспортной компании</description>
    </items>
    <items>
      <name>ТранспортныеУслугиДоставкаПокупателюТранспортнойКомпании44</name>
      <description>44 Транспортные услуги доставка покупателю транспортной компании</description>
    </items>
    <items>
      <name>АмерПаллет</name>
      <description>Амер паллет</description>
    </items>
    <items>
      <name>ОчередьАРМ_БракНаСкладе</name>
      <description>Брак на складе</description>
    </items>
    <items>
      <name>ОчередьАРМ_ВидПроверки</name>
      <description>Вид проверки</description>
    </items>
    <items>
      <name>ВыходнойКонтроль</name>
      <description>Выходной контроль</description>
    </items>
    <items>
      <name>ЕвроПаллет</name>
      <description>Евро паллет</description>
    </items>
    <items>
      <name>Паллет</name>
      <description>Паллет</description>
    </items>
    <items>
      <name>ПричинаОтменыПроизводстваПоУмолчанию</name>
      <description>Причина отмены производства(По умолчанию)</description>
    </items>
    <items>
      <name>РольОтветственныйЗаСпецификации</name>
      <description>Роль ответственный за спецификации</description>
    </items>
    <items>
      <name>ТПСОтделЛогистикиИВЭД</name>
      <description>ТПСОтдел логистики ИВЭД</description>
    </items>
    <items>
      <name>ТранспортныеУслугиДоставкаПокупателюТранспортнойКомпании</name>
      <description>Транспортные услуги доставка покупателю транспортной компании</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.НаборыУпаковок</types>
      <types>String</types>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьОтгрузкуИЗаполнитьСерииВОбеспечении() Экспорт
	
	Для Каждого СтрокаОбеспечения Из ОбеспечениеМатериаламиИРаботами Цикл
		СтрокаОбеспечения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Спецификация) Тогда
		ЗаполнитьДействияПоСпецификации(ЭтотОбъект)
	КонецЕсли;

КонецПроцедуры

&После("ПриЗаписи")
Процедура cbr_ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Распоряжение) Тогда
		Если ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
			РегистрыСведений.НормативныйГрафикЭтаповПроизводства.Рассчитать(Распоряжение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;	
	
	//++ Мохов 24.02.2026 ПРЗ.30
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьяКалькуляции", Справочники.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК Количество,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ТД
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка
	|	И НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = &СтатьяКалькуляции
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТД.Количество КАК Количество,
	|	ВТ_ТД.Склад КАК Склад,
	|	ВТ_ТД.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток
	|ИЗ
	|	ВТ_ТД КАК ВТ_ТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыНаСкладахОстатки
	|		ПО (ВТ_ТД.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)";	
	ЗапросВыборка = Запрос.Выполнить().Выбрать();
	
	Предупреждение = Ложь;
	Пока ЗапросВыборка.Следующий() Цикл
		Если ЗапросВыборка.ВНаличииОстаток - ЗапросВыборка.Количество < 0 Тогда
			Предупреждение = Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если Предупреждение И ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Некоторые материалы отсутствуют на складе'"));		
	ИначеЕсли ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Материалы в наличии'"));		
	КонецЕсли;		
		
	//-- Мохов 24.02.2026 ПРЗ.30	
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обеспечение.Номенклатура КАК Номенклатура,
		|	Обеспечение.Характеристика КАК Характеристика,
		|	Обеспечение.Упаковка КАК Упаковка,
		|	Обеспечение.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ОбеспечениеПредварительно
		|ИЗ
		|	&Обеспечение КАК Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Действия.Номенклатура КАК Номенклатура,
		|	Действия.Характеристика КАК Характеристика,
		|	Действия.Упаковка КАК Упаковка,
		|	Действия.ВнесеноПлан КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ДействияПредварительно
		|ИЗ
		|	&Действия КАК Действия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбеспечениеПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ОбеспечениеПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Обеспечение
		|ИЗ
		|	ВТ_ОбеспечениеПредварительно КАК ВТ_ОбеспечениеПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбеспечениеПредварительно.Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДействияПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ДействияПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Действия
		|ИЗ
		|	ВТ_ДействияПредварительно КАК ВТ_ДействияПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДействияПредварительно.Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Действия.Номенклатура КАК Номенклатура,
		|	ВТ_Действия.Характеристика КАК Характеристика,
		|	ВТ_Действия.Упаковка КАК Упаковка,
		|	ВТ_Действия.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Разница
		|ИЗ
		|	ВТ_Действия КАК ВТ_Действия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Обеспечение.Номенклатура,
		|	ВТ_Обеспечение.Характеристика,
		|	ВТ_Обеспечение.Упаковка,
		|	-ВТ_Обеспечение.КоличествоУпаковок
		|ИЗ
		|	ВТ_Обеспечение КАК ВТ_Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Разница.Номенклатура КАК Номенклатура,
		|	ВТ_Разница.Характеристика КАК Характеристика,
		|	ВТ_Разница.Упаковка КАК Упаковка,
		|	СУММА(ВТ_Разница.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	ВТ_Разница КАК ВТ_Разница
		|ГДЕ
		|	НЕ ВТ_Разница.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Разница.Номенклатура,
		|	ВТ_Разница.Характеристика,
		|	ВТ_Разница.Упаковка
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_Разница.КоличествоУпаковок) <> 0";
		
		Запрос.УстановитьПараметр("Обеспечение", ОбеспечениеМатериаламиИРаботами.Выгрузить());
		Запрос.УстановитьПараметр("Действия", Действия.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоУпаковок > 0 Тогда
				
				ТекстСообщения = НСтр("ru='ВНИМАНИЕ! По номенклатуре: %1 и характеристике: %2 Внесено (План) на вкладке Действия превышает количество из вкладки Материалы и работы'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.Характеристика);
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				
			Иначе
				
				ТекстСообщения = НСтр("ru='Внимание! По номенклатуре: %1 и характеристике: %2 недостаточно количества Внесено (План) (%3) на вкладке Действия'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.Характеристика, Выборка.КоличествоУпаковок);
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если Не Отказ Тогда
		
		СтатусыДляОчереди = Документы.ЭтапПроизводства2_2.СтатусыЭтаповДляОчереди();
		Если СтатусыДляОчереди.НайтиПоЗначению(Статус) = Неопределено Тогда
			
			Очередь = 0;
			
		Иначе
			
			Если Очередь = 0 Тогда
				Очередь = Документы.ЭтапПроизводства2_2.НовыйНомерОчереди();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПредыдущийСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	
	Если Не Отказ 
		И Не ЭтоНовый()
		И Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И Не ПредыдущийСтатус = Статус Тогда
		
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.КВыполнению")
			Или (Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Начат")
					И ПредыдущийСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Сформирован"))
			Тогда
		
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										   НоменклатураСервер.ПараметрыУказанияСерий(
										   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
			ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
			
			ЕстьИзменения = Ложь;
			
			СтрокаССерией = Неопределено;
			Если ЭтотОбъект[ИмяТЧСерии].Количество() = 0 Тогда
			
				Если ИмяТЧСерии = "ВыходныеИзделияСерии"
					И ВыходныеИзделия.Количество() > 0
					Тогда
					
					СозданнаяСерия = Неопределено;
					Для Каждого СтрокаВыходногоИзделия Из ВыходныеИзделия Цикл
					
						ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаВыходногоИзделия.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
						ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаВыходногоИзделия.Номенклатура);
						ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаВыходногоИзделия.Характеристика);
					
						Если ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина Тогда						
							СтрокаССерией = ВыходныеИзделияСерии.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаССерией, СтрокаВыходногоИзделия);
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
							КонецЕсли;
							СтрокаССерией.Серия = СозданнаяСерия;
							ЕстьИзменения = Истина;
						КонецЕсли;
					
					КонецЦикла; 
					
				ИначеЕсли Не ИмяТЧСерии = "ВыходныеИзделияСерии" 
					И ВыходныеИзделия.Количество() > 0 
					Тогда
					
					СозданнаяСерия = Неопределено;
					Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
						
						ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
						ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаССерией.Номенклатура);
						ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаССерией.Характеристика);
						
						Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) 
							И ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина
							Тогда
							
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
							КонецЕсли;
							СтрокаССерией.Серия = СозданнаяСерия;
							ЕстьИзменения = Истина;
						Иначе
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СтрокаССерией.Серия;
							КонецЕсли;	
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
			
			Иначе
				
				СозданнаяСерия = Неопределено;
				Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
				
					ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
					ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаССерией.Номенклатура);
					ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаССерией.Характеристика);
					Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) 
						И ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина
						Тогда
						Если СозданнаяСерия = Неопределено Тогда
							СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
						КонецЕсли;
						СтрокаССерией.Серия = СозданнаяСерия;	
						ЕстьИзменения = Истина;
					Иначе
						Если СозданнаяСерия = Неопределено Тогда
							СозданнаяСерия = СтрокаССерией.Серия;
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;
			
			Если ЕстьИзменения Тогда
				ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий.ВыходныеИзделия);
			КонецЕсли;
			
		ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Начат") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										   НоменклатураСервер.ПараметрыУказанияСерий(
										   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
			ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
			Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) Тогда
					Продолжить;					
				КонецЕсли;
				
				ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
				
				ОбъектСерия = СтрокаССерией.Серия.ПолучитьОбъект();
				ОбъектСерия.ДатаПроизводства = ФактическоеНачалоЭтапа;
				ОбъектСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ОбъектСерия.ДатаПроизводства,
																	 ДанныеПоНоменклатуре.СрокГодности,
																	 ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
																	 
				ОбъектСерия.Записать();
	
				
			КонецЦикла;
				
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры


&Перед("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	//++АшаеваАН 10.02.26 ПРЗ.13
	Если ДополнительныеСвойства.Свойство("cbr_МассивЭтапов") Тогда
		Для каждого ЭтапСсылка Из ДополнительныеСвойства.cbr_МассивЭтапов Цикл
			ЭтапОбъект = ЭтапСсылка.ПолучитьОбъект();
	        Если ЭтапОбъект.Проведен Тогда
	            ЭтапОбъект.ПометкаУдаления = Истина;
	            ЭтапОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	        Иначе    
	            ЭтапОбъект.УстановитьПометкуУдаления(Истина);
	        КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	//--АшаеваАН 10.02.26 ПРЗ.13
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДействияПоСпецификации(ДокументОбъект)
	
	//КоличествоУпаковокПлан - из этапа
	//ВыходныеИзделия.КоличествоУпаковок - первая строка из ресурсной спецификации
	Если Спецификация.ВыходныеИзделия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Спецификация.ВыходныеИзделия[0].КоличествоУпаковок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериалов = ОбеспечениеМатериаламиИРаботами.Выгрузить( , "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок");
	ТаблицаМатериалов.Свернуть("Номенклатура,Характеристика,Упаковка", "КоличествоУпаковок");
	
	ТаблицаДобавленныхДействий = ТаблицаМатериалов.Скопировать();
	ТаблицаДобавленныхДействий.Колонки.Добавить("КоличествоВДействиях", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	КоэффициентПересчета = КоличествоУпаковокПлан / Спецификация.ВыходныеИзделия[0].КоличествоУпаковок;
	
	ОтборПоЭтапу = Новый Структура("Этап", Этап);
	ТаблицаДействий = Спецификация.Действия.Выгрузить(ОтборПоЭтапу);
	Для Каждого ДействиеСпецификации Из ТаблицаДействий Цикл
		
		НоваяСтрокаДействий = Действия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДействий, ДействиеСпецификации);
		НоваяСтрокаДействий.ВнесеноПлан = ДействиеСпецификации.КоличествоУпаковок * КоэффициентПересчета;

		ОтборПоДобавленнымДействиям = Новый Структура("Номенклатура,Характеристика,Упаковка");
		ЗаполнитьЗначенияСвойств(ОтборПоДобавленнымДействиям, ДействиеСпецификации);
		НайденнаяСтрокаДобавленныхДействий = ТаблицаДобавленныхДействий.НайтиСтроки(ОтборПоДобавленнымДействиям);
		Если НайденнаяСтрокаДобавленныхДействий.Количество() > 0 Тогда
			
			СтрокаДействия = НайденнаяСтрокаДобавленныхДействий[0];
			Если СтрокаДействия.КоличествоВДействиях + НоваяСтрокаДействий.ВнесеноПлан > СтрокаДействия.КоличествоУпаковок Тогда
				НоваяСтрокаДействий.ВнесеноПлан = СтрокаДействия.КоличествоУпаковок - СтрокаДействия.КоличествоВДействиях; 
			КонецЕсли;
			
			СтрокаДействия.КоличествоВДействиях = СтрокаДействия.КоличествоВДействиях + НоваяСтрокаДействий.ВнесеноПлан;
			
		КонецЕсли;			
		
		НоваяСтрокаДействий.Продолжительность = ДействиеСпецификации.Время;
		НоваяСтрокаДействий.ТемператураПлан = ДействиеСпецификации.Температура;
		НоваяСтрокаДействий.ДавлениеПлан = ДействиеСпецификации.Давление;
		НоваяСтрокаДействий.СкоростьВращенияПлан = ДействиеСпецификации.СкоростьВращения;
		
	КонецЦикла;
	
	Для Каждого СтрокаДобавленныхДействий Из ТаблицаДобавленныхДействий Цикл
		Если СтрокаДобавленныхДействий.КоличествоУпаковок > СтрокаДобавленныхДействий.КоличествоВДействиях Тогда 
			ОтборПоДействиям = Новый Структура("Номенклатура,Характеристика,Упаковка");
			ЗаполнитьЗначенияСвойств(ОтборПоДействиям, СтрокаДобавленныхДействий);
			НайденныеСтрокиДействий = Действия.НайтиСтроки(ОтборПоДействиям);
			Если НайденныеСтрокиДействий.Количество() > 0 Тогда
				СтрокаДействия = НайденныеСтрокиДействий[НайденныеСтрокиДействий.Количество() - 1];
				СтрокаДействия.ВнесеноПлан = СтрокаДействия.ВнесеноПлан + 
											СтрокаДобавленныхДействий.КоличествоУпаковок -
											СтрокаДобавленныхДействий.КоличествоВДействиях; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьСерию(ДанныеПоНоменклатуре)
	
	НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	НоваяСерия.Номер = РегистрыСведений.НомераСерийПоВидам.СледущийНомерСерии(ДанныеПоНоменклатуре.ВидНоменклатуры);
	НоваяСерия.ВидНоменклатуры = ДанныеПоНоменклатуре.ВидНоменклатуры;
	НоваяСерия.ДатаПроизводства = ТекущаяДатаСеанса();
	НоваяСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(НоваяСерия.ДатаПроизводства,
																		   ДанныеПоНоменклатуре.СрокГодности,
																		   ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
																		   
	НоваяСерия.ЗаполнитьСтатусГодностиВСерии(ДанныеПоНоменклатуре);
	
	НоваяСерия.Записать();
	
	Возврат НоваяСерия.Ссылка;
	
КонецФункции

//++ Мохов ПРЗ.19
//Процедура создания документа "Заявка на контроль" на основании данных этапа
Процедура cbr_СоздатьДокументЛимсЗаявкаНаКонтроль()
	ЗаявкаНаКонтрольОбъект = Документы.лимсЗаявкаНаКонтроль.СоздатьДокумент();
	ЗаявкаНаКонтрольОбъект.Заполнить(Ссылка);
	Если ЗаявкаНаКонтрольОбъект.ПроверитьЗаполнение() Тогда
		Попытка
			ЗаявкаНаКонтрольОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана!" + Символы.ПС + 
			ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("Заявка на контроль не создана!" + Символы.ПС + 
			ОписаниеОшибки(),УровеньЖурналаРегистрации.Предупреждение,,,,);
		КонецПопытки;
	КонецЕсли;			
КонецПроцедуры	//-- Мохов ПРЗ.19


&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	//++ Мохов ПРЗ.19
	//Переменная для контроля заполненности значений для создания документа
	ЗаявкаНаКонтрольОтказ = Ложь;		
	
	ОсновноеИзделиеЭтап = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация,"ОсновноеИзделиеЭтап");	
	лимсОперативныйКонтроль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеИзделиеЭтап,"лимсОперативныйКонтроль");
	лимсВидыПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеИзделиеЭтап,"ЛимсВидыПроверки").Выгрузить();
	//Контроль заполненности значений
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Статус");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Статус",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;			
	ИначеЕсли НЕ ЗначениеЗаполнено(Спецификация) Тогда	
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Спецификация");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Спецификация",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;	
	ИначеЕсли НЕ ЗначениеЗаполнено(лимсОперативныйКонтроль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Оперативный контроль в Основное изделие");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Оперативный контроль в Основное изделие",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;	
	ИначеЕсли ВыходныеИзделия.Количество() = 0 Тогда	
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение таблицы Выходные изделия");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения таблицы Выходные изделия",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;			
	ИначеЕсли лимсВидыПроверки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение таблицы Виды проверки в Основное изделие");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения таблицы Виды проверки в Основное изделие",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;
	КонецЕсли;
	//Получение значения НЕ предопределнного значения спрвочника
	ЛимсВидПроверкиСсылка	= Справочники.cbr_ПредопределенныеЗначенияКонстант.ВыходнойКонтроль;
	ЛимсВидПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛимсВидПроверкиСсылка,"Значение");		
	//Проверка значений реквизитов по услвоиям для создания документа на основании
	Если НЕ ЗаявкаНаКонтрольОтказ 
		И лимсОперативныйКонтроль = истина
		И ЛимсВидыПроверки[0].ВидПроверки = ЛимсВидПроверки
		И Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат Тогда				
			//Проверека на произведенность изделий
			Если НЕ ВыходныеИзделия.Найти(Ложь,"Произведено") = Неопределено Тогда		
				Запрос = новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	лимсЗаявкаНаКонтроль.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.лимсЗаявкаНаКонтроль КАК лимсЗаявкаНаКонтроль
				|ГДЕ
				|	НЕ лимсЗаявкаНаКонтроль.ПометкаУдаления 
				|	И лимсЗаявкаНаКонтроль.Проведен
				|	И лимсЗаявкаНаКонтроль.ДокументОснование = &ДокументОснование";
				Запрос.Установитьпараметры("ДокументОснование","Ссылка");
				РезультатЗапрос = Запрос.Выполнить().Выбрать();
				//Првоверяем, был ли уже создан смежный документ
				Если РезультатЗапрос.Следующий() Тогда
					ОбщегоНазначения.СообщитьПользователю("По данному этапу производства уже создана заявка на контроль:"
					 + РезультатЗапрос.Ссылка);
				//Если нет, делаем новый
				Иначе					
					cbr_СоздатьДокументЛимсЗаявкаНаКонтроль();							
				КонецЕсли;
			Иначе 
				ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! В таблице Выходные изделия не все элемнеты имеют свойство "+"Произведено" +"!");
				ЗаписьЖурналаРегистрации("Заявка на контроль не создана! В таблице Выходные изделия не все элемнеты имеют свойство "+"Произведено" +"!",
				УровеньЖурналаРегистрации.Предупреждение,,,,);						
			КонецЕсли;		
	КонецЕсли;	
	//-- Мохов 06.02.2026 ПРЗ.19
	
	НовыеДокументыРасходныхОрдеров = Документы.РасходныйОрдерНаТовары.СоздатьРасходныеОрдераИзЭтапа(ЭтотОбъект);
	Для Каждого ДокументРасходныйОрдер Из НовыеДокументыРасходныхОрдеров Цикл
		Документы.ОтборРазмещениеТоваров.СоздатьОтборРазмещениеИзРасходногоОрдера(ДокументРасходныйОрдер);
	КонецЦикла; 
	
	Если Не Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда 
		Возврат;
	КонецЕсли;	
	
	//Мохов ПРЗ.19
	//Если тпсКонтролиЭтапов.ЕстьЗаявкаНаКонтрольПоЭтапуПроизводства(Ссылка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ВидНоменклатуры = Неопределено;
	
	Если Не ВыходныеИзделия.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ВыходныеИзделия[0].Номенклатура;
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат;			
	КонецЕсли;
	
	ЭтоПолуфабрикат = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
	
	Если Не (ЭтоПолуфабрикат = Ложь Или ЭтоПолуфабрикат = Неопределено) Тогда
		Возврат;	
	КонецЕсли; 
	
	//ЗаявкаНаКонтрольОбъект = Документы.лимсЗаявкаНаКонтроль.СоздатьДокумент();
	//ЗаявкаНаКонтрольОбъект.Заполнить(Ссылка);
	//ЗаявкаНаКонтрольОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее 

//++ ШмелевР 04.03.2026 ПРЗ.3
&ИзменениеИКонтроль("ОтразитьКоличествоОтмененоВТЧ")
Процедура cbr_ОтразитьКоличествоОтмененоВТЧ(ПричинаОтмены)
	
	Если КоличествоУпаковокПлан = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет коэффициента
	Коэффициент = 0;
	Если УпаковкаПлан = УпаковкаОтменено Тогда
		Коэффициент = КоличествоУпаковокОтменено/КоличествоУпаковокПлан;
	Иначе
		Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПартияПроизводства, "ОсновноеИзделиеНоменклатура");
		КоэффициентПлан = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(УпаковкаПлан, Номенклатура);
		КоэффициентОтменено = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(УпаковкаОтменено, Номенклатура);
		Коэффициент = (КоличествоУпаковокОтменено * КоэффициентОтменено) / (КоличествоУпаковокПлан * КоэффициентПлан);
	КонецЕсли;
	
	// Описание переменных
	СтруктураПоиска = Новый Структура("Подразделение, Номенклатура, Характеристика");
	СтруктураПоискаСерии = Новый Структура("Подразделение, Номенклатура, Характеристика, Получатель, Назначение, Произведено, ДатаПроизводства");
	СтрокиКОбработке = Новый Массив;
	СтруктураДействий = Новый Структура("ПересчитатьКоличествоУпаковок");
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);
	КолонкиИсключения = "КодСтроки, ИдентификаторСтроки, КлючНоменклатура";
	
	// Обеспечение материалами и работами
	ТаблицаИтоги = ОбеспечениеМатериаламиИРаботами.Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество, Отменено");
	ТаблицаИтоги.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	
	Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Отменено", Истина)) Цикл
		Строка.КоличествоОтменено = Строка.Количество;
	КонецЦикла;
	ТаблицаИтоги.Свернуть("Подразделение, Номенклатура, Характеристика", "Количество, КоличествоОтменено, Распределить");
	Для каждого Строка Из ТаблицаИтоги Цикл
		Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоОтменено;
	КонецЦикла;
	ТаблицаИтоги.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");
	#Вставка
	//++ ШмелевР 04.03.2026 ПРЗ.3
	ОбеспечениеМатериаламиИРаботамиКопия = ОбеспечениеМатериаламиИРаботами.Выгрузить();
	//-- ШмелевР 04.03.2026 ПРЗ.3
	#КонецВставки
	Индекс = 0;
	
	Пока Индекс < ОбеспечениеМатериаламиИРаботами.Количество() Цикл
		
		Строка = ОбеспечениеМатериаламиИРаботами[Индекс];
		Индекс = Индекс + 1;
		Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить
			ИЛИ Строка.Отменено
			ИЛИ Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
		Если СтрокаИтоги.Распределить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОтменено = Строка;
		
		Если СтрокаИтоги.Распределить < Строка.Количество Тогда
			
			НоваяСтрока = ОбеспечениеМатериаламиИРаботами.Вставить(Индекс);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, КолонкиИсключения);
			НоваяСтрока.Количество = СтрокаИтоги.Распределить;
			СтрокиКОбработке.Добавить(НоваяСтрока);
			
			Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
			СтрокиКОбработке.Добавить(Строка);
			
			СтрокаОтменено = НоваяСтрока;
			Индекс = Индекс + 1;
			
		КонецЕсли;
		
		СтрокаОтменено.Отменено = Истина;
		СтрокаОтменено.ПричинаОтмены = ПричинаОтмены;
			
		СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаОтменено.Количество;
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		СтрокиКОбработке,
		СтруктураДействий,
		ОбеспечениеМатериаламиИРаботами,
		КэшированныеЗначения);
	СтрокиКОбработке.Очистить();
	
	ЗаполнитьСтатусыУказанияСерийВТЧ("ОбеспечениеМатериаламиИРаботами", ПараметрыУказанияСерий);
	
	// Выходные и побочные изделия
	Для Сч = 1 По 2 Цикл
		
		ИмяТЧ = ?(Сч = 1, "ВыходныеИзделия", "ПобочныеИзделия");
		
		ТаблицаИтоги = ТабличнаяЧастьПоИмени(ИмяТЧ).Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество, Отменено");
		ТаблицаИтоги.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		
		Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Отменено", Истина)) Цикл
			Строка.КоличествоОтменено = Строка.Количество;
		КонецЦикла;
		ТаблицаИтоги.Свернуть("Подразделение, Номенклатура, Характеристика", "Количество, КоличествоОтменено, Распределить");
		Для каждого Строка Из ТаблицаИтоги Цикл
			Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоОтменено;
		КонецЦикла;
		ТаблицаИтоги.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");
		
		Индекс = 0;
		Пока Индекс < ЭтотОбъект[ИмяТЧ].Количество() Цикл
			
			Строка = ЭтотОбъект[ИмяТЧ][Индекс];
			Индекс = Индекс + 1;
			Если Строка.Произведено
				ИЛИ Строка.Отменено
				ИЛИ Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
			СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
			Если СтрокаИтоги.Распределить <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОтменено = Строка;
			Если СтрокаИтоги.Распределить < Строка.Количество Тогда
				
				НоваяСтрока = ЭтотОбъект[ИмяТЧ].Вставить(Индекс);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, КолонкиИсключения);
				НоваяСтрока.Количество = СтрокаИтоги.Распределить;
				СтрокиКОбработке.Добавить(НоваяСтрока);
				
				Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
				СтрокиКОбработке.Добавить(Строка);
				
				Если ИмяТЧ = "ВыходныеИзделия" Тогда
					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
						НоваяСтрока,
						Строка,
						СпособРаспределенияЗатратНаВыходныеИзделия);
				КонецЕсли;
				
				СтрокаОтменено = НоваяСтрока;
				Индекс = Индекс + 1;
				
			КонецЕсли;
			СтрокаОтменено.Отменено = Истина;
			СтрокаОтменено.ПричинаОтмены = ПричинаОтмены;
				
			СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаОтменено.Количество;

		КонецЦикла;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			СтрокиКОбработке,
			СтруктураДействий,
			ЭтотОбъект[ИмяТЧ],
			КэшированныеЗначения);
		СтрокиКОбработке.Очистить();
	
		ЗаполнитьСтатусыУказанияСерийВТЧ(ИмяТЧ, ПараметрыУказанияСерий);
		
	КонецЦикла;
	
	// Трудозатраты
	СтруктураПоиска = Новый Структура("Подразделение, ВидРабот");
	
	ТаблицаИтоги = Трудозатраты.Выгрузить(, "Подразделение, ВидРабот, Количество, Отменено");
	ТаблицаИтоги.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	
	Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Отменено", Истина)) Цикл
		Строка.КоличествоОтменено = Строка.Количество;
	КонецЦикла;
	ТаблицаИтоги.Свернуть("Подразделение, ВидРабот", "Количество, КоличествоОтменено, Распределить");
	Для каждого Строка Из ТаблицаИтоги Цикл
		Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоОтменено;
	КонецЦикла;
	ТаблицаИтоги.Индексы.Добавить("Подразделение, ВидРабот");
	
	Индекс = 0;
	Пока Индекс < Трудозатраты.Количество() Цикл
		
		Строка = Трудозатраты[Индекс];
		Индекс = Индекс + 1;
		Если Строка.Выполнено
			ИЛИ Строка.Отменено
			ИЛИ Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
		Если СтрокаИтоги.Распределить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОтменено = Строка;
		Если СтрокаИтоги.Распределить < Строка.Количество Тогда
			
			НоваяСтрока = Трудозатраты.Вставить(Индекс);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "КодСтроки,КлючВидРабот");
			НоваяСтрока.Количество = СтрокаИтоги.Распределить;
			
			Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
			
			СтрокаОтменено = НоваяСтрока;
			Индекс = Индекс + 1;
			
		КонецЕсли;
		СтрокаОтменено.Отменено = Истина;
		СтрокаОтменено.ПричинаОтмены = ПричинаОтмены;
		
		СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаОтменено.Количество;
		
	КонецЦикла;
	#Вставка
	//++ ШмелевР 04.03.2026 ПРЗ.3
	ОбеспечениеМатериаламиИРаботами.Загрузить(ОбеспечениеМатериаламиИРаботамиКопия);
	//-- ШмелевР 04.03.2026 ПРЗ.3
	#КонецВставки
КонецПроцедуры //++ ШмелевР 04.03.2026 ПРЗ.3

#КонецОбласти

#КонецЕсли
